Autodesk.Revit.DB.InsulationLiningBase.IsValidThickness(System.Double)
Identifies if the given thickness value is valid for assignment to insulation or lining elements.
thickness:
Thickness of the insulation and lining elements.
Returns:
True if the thickness is valid, false otherwise.
Since:
2012

Autodesk.Revit.DB.InsulationLiningBase.GetLiningIds(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Returns the ids of the lining elements associated to a given element.
document:
The document.
elemId:
The element.
Returns:
A collection of the ids of the lining elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This id does not represent a duct, fitting, or accessory element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.InsulationLiningBase.GetInsulationIds(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Returns the ids of the insulation elements associated to a given element.
document:
The document.
elemId:
The element.
Returns:
A collection of the ids of the insulation elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This id does not represent a valid host for insulation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.InsulationLiningBase.HostElementId
The id of the host element for the insulation or lining element.
Since:
2012

Autodesk.Revit.DB.InsulationLiningBase.Thickness
Thickness of the insulation or lining element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: Thickness is not valid for assignment to insulation or lining elements.
Since:
2012

Autodesk.Revit.DB.InsulationLiningBase
Acts as the base class for duct insulation, pipe insulation and duct lining elements.
Since:
2012